print("1,234,12,100,45中最大值为：", max(1, 234, 12, 100))
print("1,1312,12,100,45中最大值为：", max(1, 1312, 12, 100, 45))
print("1,2,12,100,45中最大值为：", max(1, 2, 12, 100, 45))
print("1,554,12,120,45中最大值为：", max(1, 554, 12, 120, 45))
print("1,554,12,120,45中最小值为：", min(1, -554, 12, 120, 45))
#列表内数字取最小/最大
print("1,-1554,12,120,45中最小值为：", min([1, -1554, 12, 120, 45]))
print("1,-1554,12,120,45中最大值为：", max([1, -1554, 12, 120, 45]))
#元组内数字取最小/最大
print("1,23,12,-120,45中最小值为：", min((1, 23, 12, -120, 45)))
print("1,23,12,-120,45中最大值为：", max((1, 23, 12, -120, 45)))
#字母中取最小/最大
print("w,x,z,a,b中最大值为：", max('x', 'x', 'z', 'a', 'b'))
print("w,x,z,a,b中最小值为：", min('x', 'x', 'z', 'a', 'b'))
